In [83]:
 # Capitulo 29 apply
import pandas as pd
import numpy as np


df = pd.DataFrame(np.random.randint(0,100,size = (7,2)),
columns = ['fst','snd'])
df

   fst  snd
0   79    4
1   42   58
2   31    1
3   65   41
4   57   35
5   11   46
6   82   91

In [84]:
df.apply(np.sqrt)

        fst       snd
0  8.888194  2.000000
1  6.480741  7.615773
2  5.567764  1.000000
3  8.062258  6.403124
4  7.549834  5.916080
5  3.316625  6.782330
6  9.055385  9.539392

In [85]:
df.apply(np.sum, axis = 1)

0     83
1    100
2     32
3    106
4     92
5     57
6    173
dtype: int64

In [86]:
df.apply(np.sum)

fst    367
snd    276
dtype: int64

In [87]:
# Resampling

np.random.seed(0)
rng = pd.date_range('2015-02-24', periods=10, freq='T')
df = pd.DataFrame({'Val' : np.random.randn(len(rng))}, index=rng)
df

                          Val
2015-02-24 00:00:00  1.764052
2015-02-24 00:01:00  0.400157
2015-02-24 00:02:00  0.978738
2015-02-24 00:03:00  2.240893
2015-02-24 00:04:00  1.867558
2015-02-24 00:05:00 -0.977278
2015-02-24 00:06:00  0.950088
2015-02-24 00:07:00 -0.151357
2015-02-24 00:08:00 -0.103219
2015-02-24 00:09:00  0.410599

In [88]:
df.resample('5min').sum()

                          Val
2015-02-24 00:00:00  7.251399
2015-02-24 00:05:00  0.128833

In [89]:
df.resample('30s').ffill()

                          Val
2015-02-24 00:00:00  1.764052
2015-02-24 00:00:30  1.764052
2015-02-24 00:01:00  0.400157
2015-02-24 00:01:30  0.400157
2015-02-24 00:02:00  0.978738
2015-02-24 00:02:30  0.978738
2015-02-24 00:03:00  2.240893
2015-02-24 00:03:30  2.240893
2015-02-24 00:04:00  1.867558
2015-02-24 00:04:30  1.867558
2015-02-24 00:05:00 -0.977278
2015-02-24 00:05:30 -0.977278
2015-02-24 00:06:00  0.950088
2015-02-24 00:06:30  0.950088
2015-02-24 00:07:00 -0.151357
2015-02-24 00:07:30 -0.151357
2015-02-24 00:08:00 -0.103219
2015-02-24 00:08:30 -0.103219
2015-02-24 00:09:00  0.410599

In [90]:
# Capitulo 34 Resampling and pivoting

df = pd.DataFrame({'Name':['Mary', 'Josh','Jon','Lucy', 'Jane', 'Sue'],
'Age':[34, 37, 29, 40, 29, 31],
'City':['Boston','New York', 'Chicago', 'Los Angeles', 'Chicago',
'Boston'],
'Position':['Manager','Programmer','Manager','Manager','Programmer',
'Programmer']},
columns=['Name','Position','City','Age'])

df

   Name    Position         City  Age
0  Mary     Manager       Boston   34
1  Josh  Programmer     New York   37
2   Jon     Manager      Chicago   29
3  Lucy     Manager  Los Angeles   40
4  Jane  Programmer      Chicago   29
5   Sue  Programmer       Boston   31

In [91]:
df.pivot(index='Position', columns='City', values='Age')

City        Boston  Chicago  Los Angeles  New York
Position
Manager       34.0     29.0         40.0       NaN
Programmer    31.0     29.0          NaN      37.0

In [92]:
df.pivot(index='Position', columns='City', values='Age').reset_index().rename_axis(None, axis=1).fillna(0)

     Position  Boston  Chicago  Los Angeles  New York
0     Manager    34.0     29.0         40.0       0.0
1  Programmer    31.0     29.0          0.0      37.0

In [93]:
df.pivot(index='Position', columns='City', values='Name')

City       Boston Chicago Los Angeles New York
Position
Manager      Mary     Jon        Lucy      NaN
Programmer    Sue    Jane         NaN     Josh

In [94]:
df = pd.DataFrame({'Name':['Mary', 'Jon','Lucy', 'Jane', 'Sue', 'Mary', 'Lucy'],
'Age':[35, 37, 40, 29, 31, 26, 28],
'City':['Boston', 'Chicago', 'Los Angeles', 'Chicago', 'Boston', 'Boston',
'Chicago'],
'Position':['Manager','Manager','Manager','Programmer',
'Programmer','Manager','Manager'],
'Sex':['Female','Male','Female','Female', 'Female','Female','Female']},
columns=['Name','Position','City','Age','Sex'])

df

   Name    Position         City  Age     Sex
0  Mary     Manager       Boston   35  Female
1   Jon     Manager      Chicago   37    Male
2  Lucy     Manager  Los Angeles   40  Female
3  Jane  Programmer      Chicago   29  Female
4   Sue  Programmer       Boston   31  Female
5  Mary     Manager       Boston   26  Female
6  Lucy     Manager      Chicago   28  Female

In [95]:
# df.pivot(index='Position', columns='City', values='Age')

In [96]:
df.pivot_table(index='Position', columns='City', values='Age')

City        Boston  Chicago  Los Angeles
Position
Manager       30.5     32.5         40.0
Programmer    31.0     29.0          NaN

In [97]:
df.pivot_table(index='Position', columns='City', values='Age', aggfunc='sum')

City        Boston  Chicago  Los Angeles
Position
Manager       61.0     65.0         40.0
Programmer    31.0     29.0          NaN

In [98]:
s = pd.Series([10, 20, 30])
s2 = pd.Series([1.5, 2.5, 3.5], index=['a', 'b', 'c'], name='my_series')
s3 = pd.Series(['a', 'b', 'c'], index=list('ABC')) # Especifica cual es el indice

In [99]:
np.random.seed(0)
rng = pd.date_range('2015-02-24', periods=5, freq='T')
s = pd.Series(np.random.randn(len(rng)), index=rng)
print (s)

2015-02-24 00:00:00    1.764052
2015-02-24 00:01:00    0.400157
2015-02-24 00:02:00    0.978738
2015-02-24 00:03:00    2.240893
2015-02-24 00:04:00    1.867558
Freq: T, dtype: float64

In [100]:
rng = pd.date_range('2015-02-24', periods=5, freq='T')
s1 = pd.Series(rng)
print (s1)

0   2015-02-24 00:00:00
1   2015-02-24 00:01:00
2   2015-02-24 00:02:00
3   2015-02-24 00:03:00
4   2015-02-24 00:04:00
dtype: datetime64[ns]

In [101]:
s = pd.Series([1, 4, 6, 3, 8, 7, 4, 5])
s

0    1
1    4
2    6
3    3
4    8
5    7
6    4
7    5
dtype: int64

In [102]:
s[2]

6

In [103]:
s.loc[2]

6

In [104]:
s[1:3]
s[s > 5]
s.mean()
s.min()
s.max()
s.std()
s.astype(float)
s.values
s.copy()

0    1
1    4
2    6
3    3
4    8
5    7
6    4
7    5
dtype: int64

In [105]:
# funciones aplicadas a series

def square(x):
    return x*x

s = pd.Series([3, 7, 5, 8, 9, 1, 0, 4])
s.apply(square)

0     9
1    49
2    25
3    64
4    81
5     1
6     0
7    16
dtype: int64

In [106]:
s.apply(lambda x: x*x)

0     9
1    49
2    25
3    64
4    81
5     1
6     0
7    16
dtype: int64

In [107]:
q = pd.Series(['Bob', 'Jack', 'Rose'])
q.apply(str.lower)
q.str.lower()
q.str.len()

0    3
1    4
2    4
dtype: int64

In [108]:
# Capitulo 37 Shifting and lagging data

df = pd.DataFrame({'eggs': [1,2,4,8,], 'chickens': [0,1,2,4,]})
df

   eggs  chickens
0     1         0
1     2         1
2     4         2
3     8         4

In [109]:
df.shift() # Corre la tabla hacia abajo una posicion por defecto

   eggs  chickens
0   NaN       NaN
1   1.0       0.0
2   2.0       1.0
3   4.0       2.0

In [110]:
df.shift(-2) # Corre la tabla hacia arriba dos posiciones

   eggs  chickens
0   4.0       2.0
1   8.0       4.0
2   NaN       NaN
3   NaN       NaN

In [111]:
df['eggs'].shift(1) - df['chickens']

0    NaN
1    0.0
2    0.0
3    0.0
dtype: float64

In [112]:
# Capitulo 38 Simple manipulacion de dataframes

np.random.seed(0)
df = pd.DataFrame(np.random.randn(5, 6), columns=list('ABCDEF'))
df

          A         B         C         D         E         F
0  1.764052  0.400157  0.978738  2.240893  1.867558 -0.977278
1  0.950088 -0.151357 -0.103219  0.410599  0.144044  1.454274
2  0.761038  0.121675  0.443863  0.333674  1.494079 -0.205158
3  0.313068 -0.854096 -2.552990  0.653619  0.864436 -0.742165
4  2.269755 -1.454366  0.045759 -0.187184  1.532779  1.469359

In [113]:
# Borrando columnas

del df['C']
df

          A         B         D         E         F
0  1.764052  0.400157  2.240893  1.867558 -0.977278
1  0.950088 -0.151357  0.410599  0.144044  1.454274
2  0.761038  0.121675  0.333674  1.494079 -0.205158
3  0.313068 -0.854096  0.653619  0.864436 -0.742165
4  2.269755 -1.454366 -0.187184  1.532779  1.469359

In [114]:
df.drop(['B', 'E'], axis='columns', inplace=True)
df

          A         D         F
0  1.764052  2.240893 -0.977278
1  0.950088  0.410599  1.454274
2  0.761038  0.333674 -0.205158
3  0.313068  0.653619 -0.742165
4  2.269755 -0.187184  1.469359

In [115]:
df.drop(df.columns[[0, 2]], axis='columns')

          D
0  2.240893
1  0.410599
2  0.333674
3  0.653619
4 -0.187184

In [117]:
# RENOMBRANDO COLUMNAS

df = pd.DataFrame({'old_name_1': [1, 2, 3], 'old_name_2': [5, 6, 7]})
df

   old_name_1  old_name_2
0           1           5
1           2           6
2           3           7

In [ ]:
df.rename(columns={'old_name_1': 'new_name_1', 'old_name_2': 'new_name_2'}, inplace=True)

In [ ]:
df.rename(columns=lambda x: x.replace('old_', '_new'), inplace=True)

In [ ]:
df.columns = ['new_name_1','new_name_2']

In [119]:
# aGREGANDO COLUMNAS

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [120]:
# Asignacion directa
df['C'] = [7, 8, 9]
df['C'] = 1 # Asigna el mismo valor a todas las columnas
df['C'] = df['A'] + df['B'] # Asigna el valor de A + B como una expresion en otras columnas
df['C'] = df['A']**df['B']

In [122]:
a = [1, 2, 3]
b = [4, 5, 6]
c = [x**y for (x,y) in zip(a,b)]
c

# Aprender que hace la funcion zip
# https://docs.python.org/3/library/functions.html#zip

# Continuar el capitulo 38 mas adelante

[1, 32, 729]

In [132]:
# Capitulo 39 Manipulacion de strings


df= pd.DataFrame({'col_name': ['Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry', 'standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum']})
df
# Extract strings with a specific regex
#df= df['col_name'].str.extract[r'[Aa-Zz]']
# Replace strings within a regex
#df['col_name'].str.replace('Replace this', 'With this')

# Buscar un ejemplo de como usar expresiones regulares

                                            col_name
0  Lorem Ipsum is simply dummy text of the printi...
1  standard dummy text ever since the 1500s, when...

In [130]:
ser = pd.Series(['Lorem ipsum', 'dolor sit amet', 'consectetur adipiscing elit'])
ser
#ser.str.extract[r'[Aa-Zz]']

0                    Lorem ipsum
1                 dolor sit amet
2    consectetur adipiscing elit
dtype: object

In [135]:
# Capitulo 40 Usuando IX, iloc,loc,at,iat

df = pd.DataFrame({'one': [1, 2, 3, 4, 5],
'two': [6, 7, 8, 9, 10],
}, index=['a', 'b', 'c', 'd', 'e'])
df

   one  two
a    1    6
b    2    7
c    3    8
d    4    9
e    5   10

In [ ]:
df.iloc[0, 0]
df.iloc[1, 1] = '21'
df.loc['c', 'two'] = 33
df.loc['a':'c']
df.loc['b':'d', 'two']
df.loc['b', 1]

In [136]:
# Trabajando con series de tiempo

# The number of sample to generate
nb_sample = 100
# Seeding to obtain a reproductible dataset
np.random.seed(0)
se = pd.Series(np.random.randint(0, 100, nb_sample),
index = pd.date_range(start = pd.to_datetime('2016-09-24'),
periods = nb_sample, freq='D'))
se.head(2)

2016-09-24    44
2016-09-25    47
Freq: D, dtype: int64

In [138]:
se.head(2).concat(se.tail(2))

AttributeError: 'Series' object has no attribute 'concat'

In [139]:
pd.__version__

'2.1.3'